package com.wx.compose.multiplatform.core.utils

object LrcTest {

    const val lrcTest = "[00:00.00]\n" +
            "[00:00.31]程响 - 等你归来\n" +
            "[00:21.14]我就在这里\n" +
            "[00:22.95]等你披星戴月乘着风而来\n" +
            "[00:30.08]我就在这里\n" +
            "[00:32.32]埋好烈酒候你故事开\n" +
            "[00:37.67]千千万万人海灯火阑珊\n" +
            "[00:42.49]你多少次不在\n" +
            "[00:45.93]走遍高高低低一路辗转\n" +
            "[00:50.84]朝暮青丝已白\n" +
            "[00:56.67]我在红尘等你\n" +
            "[00:59.56]人间等你\n" +
            "[01:01.64]守繁华之外\n" +
            "[01:04.67]揽尽星辰入怀\n" +
            "[01:08.01]千川归来\n" +
            "[01:10.03]化一片沧海\n" +
            "[01:13.17]我在九幽等你\n" +
            "[01:16.32]极乐等你\n" +
            "[01:18.39]望彼岸花开\n" +
            "[01:21.53]长对三生浮白\n" +
            "[01:24.77]不畏不改\n" +
            "[01:26.80]渡过去将来\n" +
            "[01:51.03]我就在这里等你\n" +
            "[01:54.11]跨山越海踏着云烟来\n" +
            "[02:00.09]我就在这里\n" +
            "[02:02.46]望尽天涯风雨也不改\n" +
            "[02:07.82]安安静静岁月时光荏苒\n" +
            "[02:12.48]你或许会徘徊\n" +
            "[02:16.12]挥别近近远远一身尘埃\n" +
            "[02:20.87]俯仰皆是无奈\n" +
            "[02:26.52]我在红尘等你\n" +
            "[02:29.61]人间等你\n" +
            "[02:31.68]守繁华之外\n" +
            "[02:34.71]揽尽星辰入怀\n" +
            "[02:37.96]千川归来\n" +
            "[02:40.04]化一片沧海\n" +
            "[02:43.23]我在九幽等你\n" +
            "[02:46.27]极乐等你\n" +
            "[02:48.39]望彼岸花开\n" +
            "[02:51.52]长对三生浮白\n" +
            "[02:54.76]不畏不改\n" +
            "[02:56.79]渡过去将来\n" +
            "[03:00.22]我在红尘等你\n" +
            "[03:03.10]人间等你\n" +
            "[03:05.23]守繁华之外\n" +
            "[03:08.21]揽尽星辰入怀\n" +
            "[03:11.46]千川归来\n" +
            "[03:13.54]化一片沧海\n" +
            "[03:16.62]我在九幽等你\n" +
            "[03:19.80]极乐等你\n" +
            "[03:21.88]望彼岸花开\n" +
            "[03:24.88]长对三生浮白\n" +
            "[03:28.20]不畏不改\n" +
            "[03:30.28]渡过去将来\n" +
            "[03:35.76]长对三生浮白\n" +
            "[03:38.80]不畏不改\n" +
            "[03:40.83]渡过去将来"
}