package com.wx.compose.multiplatform.core.utils

object LrcTest {

    const val lrcTest = "[00:00.00]\n" +
            "[00:00.31]程响 - 等你归来\n" +
            "[00:21.14]我就在这里\n" +
            "[00:22.95]等你披星戴月乘着风而来\n" +
            "[00:30.08]我就在这里\n" +
            "[00:32.32]埋好烈酒候你故事开\n" +
            "[00:37.67]千千万万人海灯火阑珊\n" +
            "[00:42.49]你多少次不在\n" +
            "[00:45.93]走遍高高低低一路辗转\n" +
            "[00:50.84]朝暮青丝已白\n" +
            "[00:56.67]我在红尘等你\n" +
            "[00:59.56]人间等你\n" +
            "[01:01.64]守繁华之外\n" +
            "[01:04.67]揽尽星辰入怀\n" +
            "[01:08.01]千川归来\n" +
            "[01:10.03]化一片沧海\n" +
            "[01:13.17]我在九幽等你\n" +
            "[01:16.32]极乐等你\n" +
            "[01:18.39]望彼岸花开\n" +
            "[01:21.53]长对三生浮白\n" +
            "[01:24.77]不畏不改\n" +
            "[01:26.80]渡过去将来\n" +
            "[01:51.03]我就在这里等你\n" +
            "[01:54.11]跨山越海踏着云烟来\n" +
            "[02:00.09]我就在这里\n" +
            "[02:02.46]望尽天涯风雨也不改\n" +
            "[02:07.82]安安静静岁月时光荏苒\n" +
            "[02:12.48]你或许会徘徊\n" +
            "[02:16.12]挥别近近远远一身尘埃\n" +
            "[02:20.87]俯仰皆是无奈\n" +
            "[02:26.52]我在红尘等你\n" +
            "[02:29.61]人间等你\n" +
            "[02:31.68]守繁华之外\n" +
            "[02:34.71]揽尽星辰入怀\n" +
            "[02:37.96]千川归来\n" +
            "[02:40.04]化一片沧海\n" +
            "[02:43.23]我在九幽等你\n" +
            "[02:46.27]极乐等你\n" +
            "[02:48.39]望彼岸花开\n" +
            "[02:51.52]长对三生浮白\n" +
            "[02:54.76]不畏不改\n" +
            "[02:56.79]渡过去将来\n" +
            "[03:00.22]我在红尘等你\n" +
            "[03:03.10]人间等你\n" +
            "[03:05.23]守繁华之外\n" +
            "[03:08.21]揽尽星辰入怀\n" +
            "[03:11.46]千川归来\n" +
            "[03:13.54]化一片沧海\n" +
            "[03:16.62]我在九幽等你\n" +
            "[03:19.80]极乐等你\n" +
            "[03:21.88]望彼岸花开\n" +
            "[03:24.88]长对三生浮白\n" +
            "[03:28.20]不畏不改\n" +
            "[03:30.28]渡过去将来\n" +
            "[03:35.76]长对三生浮白\n" +
            "[03:38.80]不畏不改\n" +
            "[03:40.83]渡过去将来"

    const val lrcTest2 ="[00:00.00]\n" +
            "\uFEFF[00:00.19]林俊杰 - 起风了 (Live)\n" +
            "[00:26.02]这一路上走走停停\n" +
            "[00:29.13]顺着少年漂流的痕迹\n" +
            "[00:32.34]迈出车站的前一刻\n" +
            "[00:35.55]竟有些犹豫\n" +
            "[00:38.86]不禁笑这近乡情怯\n" +
            "[00:42.02]仍无可避免\n" +
            "[00:44.47]而长野的天\n" +
            "[00:46.10]依旧那么暖\n" +
            "[00:47.63]风吹起了从前\n" +
            "[00:50.18]从前初识这世间\n" +
            "[00:53.18]百般流连\n" +
            "[00:55.02]看着天边似在眼前\n" +
            "[00:58.02]也甘愿赴汤蹈火去走它一遍\n" +
            "[01:03.12]如今走过这世间\n" +
            "[01:06.07]百般流连\n" +
            "[01:07.91]翻过岁月不同侧脸\n" +
            "[01:11.07]措不及防闯入你的笑颜\n" +
            "[01:20.15]我曾难自拔于世界之大\n" +
            "[01:24.18]也沉溺于其中梦话\n" +
            "[01:27.49]不得真假 不做挣扎 不惧笑话\n" +
            "[01:33.15]我曾将青春翻涌成她\n" +
            "[01:36.81]也曾指尖弹出盛夏\n" +
            "[01:39.97]心之所动 且就随缘去吧\n" +
            "[01:46.09]逆着光行走 任风吹雨打\n" +
            "[01:56.85]短短的路走走停停\n" +
            "[01:59.85]也有了几分的距离\n" +
            "[02:03.18]不知抚摸的是故事\n" +
            "[02:06.34]还是段心情\n" +
            "[02:09.60]也许期待的不过是\n" +
            "[02:12.81]与时间为敌\n" +
            "[02:15.40]再次见到你\n" +
            "[02:16.93]微凉晨光里\n" +
            "[02:18.56]笑得很甜蜜\n" +
            "[02:46.92]从前初识这世间\n" +
            "[02:50.08]百般流连\n" +
            "[02:51.72]看着天边似在眼前\n" +
            "[02:54.77]也甘愿赴汤蹈火去走它一遍\n" +
            "[02:59.87]如今走过这世间\n" +
            "[03:02.87]百般流连\n" +
            "[03:04.70]翻过岁月不同侧脸\n" +
            "[03:07.76]措不及防闯入你的笑颜\n" +
            "[03:16.89]我曾难自拔于世界之大\n" +
            "[03:20.87]也沉溺于其中梦话\n" +
            "[03:24.23]不得真假 不做挣扎 不惧笑话\n" +
            "[03:29.84]我曾将青春翻涌成她\n" +
            "[03:33.55]也曾指尖弹出盛夏\n" +
            "[03:36.76]心之所动 且就随缘去吧\n" +
            "[03:42.88]晚风吹起你鬓间的白发\n" +
            "[03:46.90]抚平回忆留下的疤\n" +
            "[03:50.17]你眼中 明暗交杂 一笑生花\n" +
            "[03:55.87]暮色遮住你蹒跚的步伐\n" +
            "[03:59.89]走进床头藏起的画\n" +
            "[04:03.05]画中的你 低着头说话\n" +
            "[04:08.76]我仍感叹于世界之大\n" +
            "[04:12.48]也沉醉于儿时情话\n" +
            "[04:15.64]不剩真假 不做挣扎 无谓笑话\n" +
            "[04:21.70]我终将青春还给了她\n" +
            "[04:25.52]连同指尖弹出的盛夏\n" +
            "[04:28.99]心之所动 就随风去了\n" +
            "[04:34.84]以爱之名 你还愿意吗"

    const val lrcTest3 ="[00:00.00] \n" +
            "\uFEFF[00:00.21]林俊杰 - 江南\n" +
            "[00:37.25]风到这里就是黏\n" +
            "[00:40.73]黏住过客的思念\n" +
            "[00:45.06]雨到了这里缠成线\n" +
            "[00:48.62]缠着我们留恋人世间\n" +
            "[00:53.17]你在身边就是缘\n" +
            "[00:56.55]缘分写在三生石上面\n" +
            "[01:01.13]爱有万分之一甜\n" +
            "[01:04.59]宁愿我就葬在这一点\n" +
            "[01:09.21]圈圈圆圆圈圈\n" +
            "[01:10.88]天天年年天天的我\n" +
            "[01:13.71]深深看你的脸\n" +
            "[01:16.05]生气的温柔\n" +
            "[01:18.02]埋怨的温柔的脸\n" +
            "[01:23.97]不懂爱恨情愁煎熬的我们\n" +
            "[01:27.86]都以为相爱就像风云的善变\n" +
            "[01:32.01]相信那一天抵过永远\n" +
            "[01:36.27]在这一刹那冻结了时间\n" +
            "[01:39.96]不懂怎么表现温柔的我们\n" +
            "[01:43.80]还以为殉情只是古老的传言\n" +
            "[01:47.79]离愁能有多痛痛有多浓\n" +
            "[01:52.34]当梦被埋在江南烟雨中\n" +
            "[01:55.64]心碎了才懂\n" +
            "[02:21.09]圈圈圆圆圈圈\n" +
            "[02:22.91]天天年年天天的我\n" +
            "[02:25.73]深深看你的脸\n" +
            "[02:28.06]生气的温柔\n" +
            "[02:30.03]埋怨的温柔的脸\n" +
            "[02:35.90]不懂爱恨情愁煎熬的我们\n" +
            "[02:39.84]都以为相爱就像风云的善变\n" +
            "[02:43.84]相信那一天抵过永远\n" +
            "[02:48.24]在这一刹那冻结了时间\n" +
            "[02:51.94]不懂怎么表现温柔的我们\n" +
            "[02:55.83]还以为殉情只是古老的传言\n" +
            "[02:59.82]离愁能有多痛痛有多浓\n" +
            "[03:04.27]当梦被埋在江南烟雨中\n" +
            "[03:07.56]心碎了才懂\n" +
            "[03:20.22]相信那一天抵过永远\n" +
            "[03:24.33]在这一刹那冻结了时间\n" +
            "[03:27.91]不懂怎么表现温柔的我们\n" +
            "[03:31.77]还以为殉情只是古老的传言\n" +
            "[03:35.76]离愁能有多痛痛有多浓\n" +
            "[03:40.31]当梦被埋在江南烟雨中\n" +
            "[03:45.71]心碎了才懂\n"
}